{
  "destination": "Pasadena",
  "startDate": "Nov 8, 2024",
  "days": [
    {
      "dayNumber": 1,
      "date": "Nov 8, 2024",
      "periods": {
        "morning": [
          {
            "time": "09:00",
            "activity": "Arrival and Check-in",
            "description": "Arrive in Pasadena, check into your accommodation, and settle in. Enjoy a relaxed breakfast at a local cafe.",
            "id": "day1_morning_0"
          },
          {
            "time": "10:30",
            "activity": "Explore Old Town Pasadena",
            "description": "Begin your exploration in the historic Old Town Pasadena. Stroll along Colorado Boulevard and its charming side streets, admiring the restored brick buildings, unique boutiques, and vibrant atmosphere. Perfect for some window shopping and soaking in the local ambiance.",
            "id": "day1_morning_1"
          }
        ],
        "afternoon": [
          {
            "time": "12:30",
            "activity": "Lunch in Old Town",
            "description": "Savor a delicious lunch at one of Old Town's many acclaimed restaurants. Options range from casual cafes to upscale dining.",
            "id": "day1_afternoon_0"
          },
          {
            "time": "14:30",
            "activity": "Visit the Norton Simon Museum",
            "description": "Immerse yourself in art at the renowned Norton Simon Museum. Discover European paintings from the Renaissance to the 20th century, a magnificent sculpture garden, and a significant collection of South and Southeast Asian art.",
            "id": "day1_afternoon_1"
          }
        ],
        "evening": [
          {
            "time": "18:30",
            "activity": "Dinner Experience",
            "description": "Enjoy an exquisite dinner at a restaurant of your choice in Old Town or nearby. Pasadena offers a diverse culinary scene.",
            "id": "day1_evening_0"
          },
          {
            "time": "20:30",
            "activity": "Evening Stroll or Dessert",
            "description": "Take a leisurely evening stroll through Old Town, perhaps stopping for a coffee or dessert, and enjoy the illuminated historic architecture.",
            "id": "day1_evening_1"
          }
        ]
      }
    },
    {
      "dayNumber": 2,
      "date": "Nov 9, 2024",
      "periods": {
        "morning": [
          {
            "time": "09:00",
            "activity": "Breakfast",
            "description": "Start your day with breakfast at your accommodation or a local eatery.",
            "id": "day2_morning_0"
          },
          {
            "time": "10:00",
            "activity": "Explore The Huntington Library, Art Museum, and Botanical Gardens",
            "description": "Dedicate your morning to The Huntington, a world-renowned cultural and botanical paradise. Wander through diverse themed gardens (Japanese, Chinese, Desert, Rose), marvel at European and American art collections, and explore the vast library's rare books and manuscripts. Allow ample time to fully appreciate this expansive estate.",
            "id": "day2_morning_1"
          }
        ],
        "afternoon": [
          {
            "time": "13:30",
            "activity": "Lunch near The Huntington or San Marino",
            "description": "Grab lunch at The Huntington's cafe or explore dining options in the nearby city of San Marino.",
            "id": "day2_afternoon_0"
          },
          {
            "time": "15:00",
            "activity": "Visit The Gamble House",
            "description": "Tour The Gamble House, an iconic masterpiece of American Arts and Crafts architecture by Greene & Greene. Admire its intricate details, handcrafted furnishings, and harmonious blend with nature. (Check tour times and book in advance if possible).",
            "id": "day2_afternoon_1"
          }
        ],
        "evening": [
          {
            "time": "18:00",
            "activity": "Scenic Drive and Rose Bowl Photo Stop",
            "description": "Take a scenic drive around the iconic Rose Bowl Stadium for a quick photo opportunity, appreciating its grandeur in the evening light.",
            "id": "day2_evening_0"
          },
          {
            "time": "19:00",
            "activity": "Dinner on South Lake Avenue",
            "description": "Experience the sophisticated dining scene along South Lake Avenue, offering a variety of restaurants from casual to fine dining.",
            "id": "day2_evening_1"
          }
        ]
      }
    },
    {
      "dayNumber": 3,
      "date": "Nov 10, 2024",
      "periods": {
        "morning": [
          {
            "time": "08:00",
            "activity": "Early Breakfast",
            "description": "Enjoy an early breakfast to fuel up for a morning of unique finds.",
            "id": "day3_morning_0"
          },
          {
            "time": "09:00",
            "activity": "Rose Bowl Flea Market Adventure (2nd Sunday of the month)",
            "description": "Spend your morning exploring the world-famous Rose Bowl Flea Market, held on the second Sunday of every month. Discover antiques, vintage clothing, collectibles, crafts, and more. It's a treasure hunter's delight! (Confirm date and entrance fees in advance).",
            "id": "day3_morning_1"
          }
        ],
        "afternoon": [
          {
            "time": "13:00",
            "activity": "Lunch and Caltech Campus Stroll",
            "description": "Have lunch near the Rose Bowl or head towards the California Institute of Technology (Caltech) campus. Afterwards, enjoy a leisurely stroll through Caltech's beautiful and historic campus, admiring its distinctive architecture and serene courtyards.",
            "id": "day3_afternoon_0"
          },
          {
            "time": "15:00",
            "activity": "Last-minute Souvenirs and Departure Prep",
            "description": "Grab any last-minute souvenirs or revisit a favorite spot. Prepare for your departure from Pasadena.",
            "id": "day3_afternoon_1"
          }
        ],
        "evening": [
          {
            "time": "17:00",
            "activity": "Depart from Pasadena",
            "description": "Begin your journey home or to your next destination, taking with you wonderful memories of Pasadena.",
            "id": "day3_evening_0"
          }
        ]
      }
    }
  ],
  "additionalActivities": [
    {
      "id": "extra_activity_0",
      "activity": "Visit Descanso Gardens",
      "description": "Explore these magnificent botanical gardens known for their camellia collection, roses, and ancient forest. A tranquil escape just a short drive from Pasadena.",
      "duration": "2-3 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_1",
      "activity": "Hike Eaton Canyon Natural Area and Waterfall Trail",
      "description": "Enjoy a moderate hike to a beautiful 40-foot waterfall in the San Gabriel Mountains foothills. Great for nature lovers.",
      "duration": "2-3 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_2",
      "activity": "Explore the Pasadena Museum of History",
      "description": "Delve deeper into Pasadena's rich past, from its early settlement to the Rose Parade, housed within the beautiful Fenyes Mansion estate.",
      "duration": "1.5-2 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_3",
      "activity": "Visit Kidspace Children's Museum",
      "description": "Perfect for families with younger children, offering interactive exhibits, outdoor play areas, and educational fun.",
      "duration": "2-3 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_4",
      "activity": "Afternoon Tea at The Langham Huntington",
      "description": "Indulge in a luxurious afternoon tea experience at the historic and elegant Langham Huntington hotel, a true Pasadena institution.",
      "duration": "2 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_5",
      "activity": "Pasadena City Hall Architectural Tour (Exterior)",
      "description": "Admire the stunning Spanish Colonial Revival architecture of Pasadena City Hall, a popular filming location and architectural marvel. Take photos and appreciate its grandeur.",
      "duration": "30-60 minutes",
      "type": "additional"
    },
    {
      "id": "extra_activity_6",
      "activity": "Stroll along Orange Grove Boulevard ('Millionaire's Row')",
      "description": "Drive or walk along this historic street, once home to Gilded Age mansions and still featuring grand estates and beautiful architecture.",
      "duration": "1-2 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_7",
      "activity": "Explore the Pacific Asia Museum (USC PAM)",
      "description": "Discover art and artifacts from Asia and the Pacific Islands in a unique Chinese courtyard-style building.",
      "duration": "1.5-2 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_8",
      "activity": "Shopping and Dining on Fillmore Street",
      "description": "Explore the diverse shops, boutiques, and eateries on Fillmore Street, offering a more local and eclectic vibe than Old Town.",
      "duration": "2-3 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_9",
      "activity": "Visit the Jet Propulsion Laboratory (JPL) Visitor Center",
      "description": "Learn about NASA's robotic exploration of space. Check their website for public lecture schedules or visitor days, as general public access can be limited.",
      "duration": "1.5-2.5 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_10",
      "activity": "Attend a performance at the Pasadena Playhouse",
      "description": "Check the schedule for a live theatrical performance at this historic and acclaimed regional theater, known for its high-quality productions.",
      "duration": "2-3 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_11",
      "activity": "Wine Tasting at a Local Wine Bar",
      "description": "Discover local and international wines at one of Pasadena's cozy wine bars, offering a relaxing evening activity.",
      "duration": "1.5-2 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_12",
      "activity": "Golf at Brookside Golf Club (next to Rose Bowl)",
      "description": "Enjoy a round of golf on one of two 18-hole championship courses located adjacent to the iconic Rose Bowl Stadium.",
      "duration": "4-5 hours",
      "type": "additional"
    },
    {
      "id": "extra_activity_13",
      "activity": "Browse the Pasadena Antique Center and Collectors Gallery",
      "description": "Hunt for unique antiques, vintage items, and collectibles across multiple vendors under one roof.",
      "duration": "1-2 hours",
      "type": "additional"
    }
  ]
}